Good link for dataframes-Pandas-data Manipulation
https://towardsdatascience.com/minimal-pandas-subset-for-data-scientists-6355059629ae

In [ ]:
#The OS module in Python provides a way of using operating system dependent functionality. 
The functions that the OS module provides allows 
you to interface with the underlying operating system that Python is running on â€“ be that Windows, Mac or Linux.
Because it is not a built-in function, you must always import it. It is a part of the standard library, however, 
so you will not need to download or install it separately from your Python installation.

In [ ]:
Two ways to read tsv file- 

A TSV file is a tab-separated values file 
stores a data table in which each record in the table is on a separate line, and data columns are separated by tabs.

pd.csv with sep=\t 
pd.read_table with no sep
pandas.read_table(filepath). The default separator is tab.

In [3]:
#Titanic Dataset

In [4]:
-through pandas hitml, we can read tabular data only on the url page but if we want to read
ads, images and dataset from that page, use beautiful soup bs4 library. It is useful there.

-if there are more than 1 table on same html page then it can read many tables. its return type is list of dataframes.
d=[df1,df2,df3...] df1 for table1, df2 for table2 etc.
then we can apply list operations on it. d[0] will give first DF which is our first table on html page.

-We cannot read all sheets of excel file simultaneously but can read individually after reading we can merge/join etc
them together.

-Pandas max display options
https://towardsdatascience.com/6-pandas-display-options-you-should-memories-84adf8887bc3
pd.options.display.max_rows
pd.options.display.max_columns
pd.options.display.max_colwidth
pd.options.display.max_info_columns
pd.options.display.precision
pd.options.display.float_format

Diff==>df.head(10) Vs pd.read_csv(url,nrows=10)
head operation is memory intensive. After reading all data,means in memory all data will be loaded then 10 rows
will be shown but in nowsw parameter it will just read 10 rows in memory.
    
from numpy, range Vs arange:
range(python core) will produce int values whereas arange(numpy) will give int/float values.

-while reading we can change the cols names and skip the rows

-r=rd.options.display.max_rows=15


General Steps:
    import libraries
    load dataset
    display dataset
    df.head()  bydefault 5
    df.tail()
    df.columns  
    df['colname'].unique()
    df.shape
    df.isnull()
    df.isnull().sum()
    drop_duplicates()
    df.rename(columns={'Indicator':'Indi'})  #change particular col name
      
    df.dtypes # datatype of each feature   #object datatype is kindof string datatype
    ---------------------
    df.describe() #small statiscal analysis of data --   for Numerical Feature only -int/float
        like in age col count is 126 and other cols is 156. it means age col has null values.
        these kind of small statiscal analysis we can do by descrbe() fnction
    ----------------------    
    #below are function for columns-Categorical
    
    df.dtypes=='object'   #To find categorical data or object kind of datatype
                          #it will give you true / False in front of EACH col name series but if cols are so many then 
        it will not good idea to use it theerfore we can use below way
        
    or
    type(df.dtypes)   ===> it will give pandas as series
    df.types[df.dtypes=='object'].index   ===> will give the col with datatype of object only
    df[df.types[df.dtypes=='object'].index] ==> it will show above result of object cols with data too 
                                                means categorical cols 
                                                store it in var and use decribe to get mini statiscal data about categorical cols too
    
    
    df_catcol=df[df.types[df.dtypes=='object'].index]
    df_catcol.describe()
    -----------------------------------
    df.columns  ==> willl give cols of dataset
    df['colname']==> will give single specified col values with indexed(by default)
    df['colname'][0:5]   => datta within system generated index 0-4
    df[['col1','col2']]  => more than one col name should be in [] like list
   ----------------------

    sorted(df['colname'])
    sort_values() method: for two cols
        df.sort_values(by=['Murder','Violent'], ascending=[False,True])
        Pandas sort_values() function sorts a data frame in Ascending or Descending order of passed Column. 
        It's diff than the sorted Python function since it cannot sort a data frame and particular column cannot be selected.
    ---------------
    
    df['col'].astype(dtype)
    ---------------------------
    to change col position==>Moving a column==>
    
    first pop the col and then insert on that particular position(index)
    # shift column 'Name' to first position
    first_column = df.pop('Name')
    # insert column using insert(position,column_name,
    # first_column) function
    df.insert(0, 'Name', first_column)
    -------------------------
    
    How to get subset of rows excluding some indexes
    bad_df = df.index.isin([5,12,23,56])
    df[~bad_df]

    -----------------------------
    
    df_train['newcolname']='value'  ==> enter new col
    
    pd.Categorical(df_train['Pclass'])     # to convert numerical col into categorical
    
    df_train['Age'].isnull()   # isnull checks specified col has null or not

    #using Numpy also we can get what are the values of non null in Age COl
    import numpy as np
    np.where(df_train['Age'].isnull()==True)
    
    df_train['Age'][154]  => gives value at index 154 in col Age

    df_train['Fare']==max(df_train['Fare'])   => gives value where fare is max in Fare COL

    np.where(df_train['Fare']==max(df_train['Fare']))   #gives indexes of Max Fare Col values

    np.where(df_train['Sex']=='male')    => gives values of Sex col where value is male 
    
    
    #If we want to acess ROWS data -- Using loc and iloc method
    df.iloc[0]==> gives 1st row index data
    df.iloc[[1,2]]==> gives you 2nd and 3rd row data
    
    #fetch all records having max fare
    np.where(df_train['Fare']==max(df_train['Fare'])) #will gives indexes 
    and we will pass indexes in iloc method df.iloc[index]
    df_train.iloc[np.where(df_train['Fare']==max(df_train['Fare']))]
    
    #loc method with indexes and col names
    df.loc[df.index[[3,4,8]],['Murder','Robbery']]

    #Now from above query find the names of the passenger who paid max fare
    #Above cell gives result as a DF therefore we can pass colname in [] of DF
    (df_train.iloc[np.where(df_train['Fare']==max(df_train['Fare']))])['Name']

    #Now count of total survivors name
    #Survivors
    df_train['Survived']==1  #True/False for given cond
    np.where(df_train['Survived']==1)   #Gives indexes of survivor=1 where cond is true
    df_train.iloc[np.where(df_train['Survived']==1)]  #gives row data where inner condition is true
    df_train.iloc[np.where(df_train['Survived']==1)])['Name']  # gives Only Name col of upper result
    len((df_train.iloc[np.where(df_train['Survived']==1)])['Name'])   #gives total count of names of survivors
    
    df['col'].between(n1,n2)=>will give true false
    df['col'].between(n1,n2)==> will give rows
    same as 
    df[(df['Murder']>=20000) & (df['Murder']<=24000)] 

    Also, check apply, progress_apply,melt,rename function of pandas

    df.dropna() #drop all nan values
df.dropna(axis=0) #drop all nan values rowwise   axis=1==>colwise
df.dropna(axis=0, thres=1)  #theshold 1 means if no. of non null values in the row is <1 then it will del the row otherwise not
df.fillna()
groupby:
    g=df.groupby('col')
    g.aggfun
    g.sum()[['Survived','Fare']]

    Merge Vs join
    very little difference. Need to specify the row indexed in case of Join.
    
    For Join two more DFs, if they have same cols then change the name of cols using lsuffix or r suffix to make all cols in all dfs diff then join will work.
    
    APPLY function:
        can apply any fun on given data of DF or can generate new data
        equivalent to  map operation in python
        

        Resample()- resample datetime series 
        A time series is a series of data points indexed (or listed or graphed) in time order. 
        Most commonly, a time series is a sequence taken at successive equally spaced points in time. 
        df.resample('freq')  will create object.
        then you can apple any aggregate func
        df.resample('M').sum()
        freq may be- M-monthly, W-weekly etc.
        10AS-for decade-10 years
    
        
    
   PAndas-json_normalize- to flatten the json data:
    notebook:
http://localhost:8888/notebooks/INeuron/Sudh_Classes2021/Class_Notes/Data%20Ananlysis/code_pandas1/examples/HW_Pandas_Data_Analysis.ipynb
link:
        https://towardsdatascience.com/all-pandas-json-normalize-you-should-know-for-flattening-json-13eae1dfb7dd        
    
    pivot_table()
    #one col need to be index and other col in cols name then data should be mean wrt to these two cols Then use pivot_table
    #For each cyl type and each number of gears, find the mean mileage.
    df.pivot_table(index='cyl', columns='gear', values='mpg', aggfunc='mean')  #mpg is mileage col to get its mean

SyntaxError: invalid syntax (<ipython-input-4-972eb394a011>, line 1)

In [5]:
import pandas as pd

In [6]:
df_train=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv',sep='\t')

In [7]:
df_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [ ]:
df_train.head()

In [ ]:
df_train.tail()

In [ ]:
df_train.describe()

In [ ]:
df_train.dtypes

In [5]:
df_train.dtypes=='object'

NameError: name 'df_train' is not defined

In [ ]:
df_train.dtypes[df_train.dtypes=='object']

In [ ]:
df_train.dtypes[df_train.dtypes=='object'].index

In [ ]:
#for using describe() on categorical cols

In [ ]:
df_catcol=df_train[df_train.dtypes[df_train.dtypes=='object'].index]

In [ ]:
df_catcol

In [ ]:
#mini statiscal data for categorical features

In [ ]:
df_catcol.describe()

In [ ]:
df_train['Embarked']  #series type

In [ ]:
df_train[['Embarked','Pclass']] #df type

In [ ]:
df_train['Embarked'][0:5]

In [ ]:
df_train['Embarked'][5:0:-1]

In [ ]:
#to enter new col with same data in all rows

In [ ]:
df_train['newcolname']='value'

In [ ]:
df_train.dtypes

In [ ]:
# to convert numerical col into categorical

In [ ]:
pd.Categorical(df_train['Pclass'])

In [ ]:
df_train['Age'].isnull()

In [ ]:
df_train['Age'].isnull()==True

In [ ]:
import numpy as np
np.where(df_train['Age'].isnull()==True)  #see aboce cell 154th index has true value for isnull()

In [ ]:
df_train['Age'][154]

In [ ]:
df_train['Fare']==max(df_train['Fare'])

In [ ]:
np.where(df_train['Fare']==max(df_train['Fare']))   #gives indexes

In [ ]:
np.where(df_train['Sex']=='male')

In [ ]:
 df_train.iloc[np.where(df_train['Fare']==max(df_train['Fare']))]

In [ ]:
#Now from above query find the names of the passenger who paid max fare
#Above cell gives result as a DF therefore we can pass colname in [] of DF

In [ ]:
(df_train.iloc[np.where(df_train['Fare']==max(df_train['Fare']))])['Name']

In [6]:
#Now count of total survivors name
#Survivors
df_train['Survived']==1
#

NameError: name 'df_train' is not defined

In [ ]:
len((df_train.iloc[np.where(df_train['Survived']==1)])['Name'])

In [ ]:
df_train['Survived']==1  #True/False for given cond
np.where(df_train['Survived']==1)   #Gives indexes of survivor=1 where cond is true
df_train.iloc[np.where(df_train['Survived']==1)]  #gives row data where inner condition is true
df_train.iloc[np.where(df_train['Survived']==1)])['Name']  # gives Only Name col of upper result
len((df_train.iloc[np.where(df_train['Survived']==1)])['Name'])   #gives total count of names of survivors

In [8]:
import numpy as np 
char_cabin = df_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
#new_Cabin
new_Cabin

['n', 'C', 'n', 'C', 'n', ..., 'C', 'n', 'n', 'n', 'n']
Length: 156
Categories (8, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'n']

# can we convert diff datatypes like list,array, dict into pandas series

In [ ]:
label=['a','b','c']
list1=[1,2,3]
arr=np.array(list1)
dict1={'a':30, 'b':35, 'c':40}

In [ ]:
pd.Series(list1)

In [ ]:
pd.Series(list1, index=['index1','index2','index3'])  #chnged default index to our index

In [ ]:
s1=pd.Series(list1, index=['index1','index2','index3'])  #chnged default index to our index
s1

In [ ]:
s1[0]   #in series, we are able to give both indexes default like 0,1 etc and specified one like indexed

In [ ]:
s1['index1']

In [ ]:
arr

In [ ]:
a=pd.Series(arr)
a

In [ ]:
a[0]

In [ ]:
dict1

In [ ]:
d=pd.Series(dict1)

In [ ]:
d[0]

In [ ]:
 d['a']

In [ ]:
s1=pd.Series([1,2,3,4], index=['a','b','c','d'])
s1

In [ ]:
s2=pd.Series([1,2,3,4], index=['a','c','c','d'])
s2

In [ ]:
s1+s2

In [ ]:
s1*s2

In [ ]:
s3=s1*s2

In [ ]:
s3

In [ ]:
s3['a']

In [ ]:
s3.iloc[0]    #iloc is integer loc

In [ ]:
s3.iloc['a']   #error- non integer index

# iloc- for integer indexes

# loc-for named indexes

In [ ]:
s3.loc['a']   #no error--because we use loc instead of iloc

# Random function

In [20]:
import pandas as pd
import numpy as np

In [21]:
from numpy.random import randn as rn

In [22]:
r=rn(5,5)     #array of random data
r

array([[ 1.75407306,  0.74284436,  1.16024581,  1.64820065, -0.1775198 ],
       [ 2.18847088, -0.81330532, -0.57444611,  0.66444442, -0.62237531],
       [-0.22034034,  1.37943298, -0.08403062, -0.85559054,  1.62671906],
       [-0.10070983,  1.18144971, -1.92600962,  0.29077064,  0.33132208],
       [ 1.50595467,  0.50496503, -0.83242071, -0.11057744,  0.26401826]])

In [23]:
df=pd.DataFrame(r, index=['a','b','c','d','e'], columns=['x','y','z','u','v'])
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
d -0.100710  1.181450 -1.926010  0.290771  0.331322
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [ ]:
df.iloc[0]  #rows values

In [ ]:
df['x'] #col values

# df.iloc[0:3] Vs df.iloc[[0,3]]

In [ ]:
df.iloc[[0,3]]   #it is diff from df.iloc[[0:3]]   [0,3] will give 0 and 3rd index rows instead [0:3] will from 0th till 2nd row

In [ ]:
df.iloc[0:3]

In [ ]:
df.iloc[3:0:-1]

In [ ]:
df.loc[['a','b','c']]

# Adding new col in dataset

In [24]:
 df['newcol']=df['x']+df['y']

In [25]:
df

          x         y         z         u         v    newcol
a  1.754073  0.742844  1.160246  1.648201 -0.177520  2.496917
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375  1.375166
c -0.220340  1.379433 -0.084031 -0.855591  1.626719  1.159093
d -0.100710  1.181450 -1.926010  0.290771  0.331322  1.080740
e  1.505955  0.504965 -0.832421 -0.110577  0.264018  2.010920

In [ ]:
df.drop('newcol',axis=1)   #axis=1 means cols  and here not deleted permanently ..just for this instance

In [2]:
df

NameError: name 'df' is not defined

# to delete newcol permamnently update the dataframe var or make inplace=True

In [26]:
df.drop('newcol',axis=1, inplace=True)

In [27]:
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
d -0.100710  1.181450 -1.926010  0.290771  0.331322
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [28]:
df.drop('d')

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [29]:
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
d -0.100710  1.181450 -1.926010  0.290771  0.331322
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [30]:
df.drop('d',inplace=True)

In [31]:
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [ ]:
#where age is null delete those records

In [37]:
df_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [42]:
df_train['Age']=='NaN'

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155    False
Name: Age, Length: 156, dtype: bool

In [45]:
df_train[df_train['Age'].isnull()==True].index

Int64Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
             48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
            126, 128, 140, 154],
           dtype='int64')

In [47]:
df_train.iloc[df_train[df_train['Age'].isnull()==True].index]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q
87,88,0,3,"Slocovski, Mr. Selman Francis",male,NaN,0,0,SOTON/OQ 392086,8.0500,NaN,S
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
109,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,A4. 54510,8.0500,NaN,S
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN,Q
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S

# Doubt

In [52]:
df_train.drop([df_train[df_train['Age'].isnull()==True].index][0])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [53]:
[df_train[df_train['Age'].isnull()==True].index]

[Int64Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
              48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
             126, 128, 140, 154],
            dtype='int64')]

In [54]:
[df_train[df_train['Age'].isnull()==True].index][0]

Int64Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
             48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
            126, 128, 140, 154],
           dtype='int64')

In [55]:
[df_train[df_train['Age'].isnull()==True].index][1]

IndexError: list index out of range

In [56]:
type([df_train[df_train['Age'].isnull()==True].index])

list

# fetching subdataset from dataset

In [57]:
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [58]:
df.iloc[0:2,3:5]       #using iloc method

          u         v
a  1.648201 -0.177520
b  0.664444 -0.622375

In [59]:
df.loc[['a','b'],['u','v']]

          u         v
a  1.648201 -0.177520
b  0.664444 -0.622375

In [60]:
df>0

       x      y      z      u      v
a   True   True   True   True  False
b   True  False  False   True  False
c  False   True  False  False   True
e   True   True  False  False   True

In [61]:
df[df>0]

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201       NaN
b  2.188471       NaN       NaN  0.664444       NaN
c       NaN  1.379433       NaN       NaN  1.626719
e  1.505955  0.504965       NaN       NaN  0.264018

In [62]:
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [ ]:
#z row where values <0

In [63]:
df['z']<0

a    False
b     True
c     True
e     True
Name: z, dtype: bool

In [64]:
df[df['z']<0]

          x         y         z         u         v
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [66]:
df[(df['z']<0) & (df['v']<0)]

          x         y         z         u         v
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375

In [67]:
df

          x         y         z         u         v
a  1.754073  0.742844  1.160246  1.648201 -0.177520
b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
c -0.220340  1.379433 -0.084031 -0.855591  1.626719
e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [69]:
df.reset_index()   #to include default indexes too and if inplace=True only then changes will be saved in dataframe

  index         x         y         z         u         v
0     a  1.754073  0.742844  1.160246  1.648201 -0.177520
1     b  2.188471 -0.813305 -0.574446  0.664444 -0.622375
2     c -0.220340  1.379433 -0.084031 -0.855591  1.626719
3     e  1.505955  0.504965 -0.832421 -0.110577  0.264018

In [70]:
df.set_index('z')  #making col z as index

                  x         y         u         v
z
 1.160246  1.754073  0.742844  1.648201 -0.177520
-0.574446  2.188471 -0.813305  0.664444 -0.622375
-0.084031 -0.220340  1.379433 -0.855591  1.626719
-0.832421  1.505955  0.504965 -0.110577  0.264018

In [9]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [10]:
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [11]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [12]:
print(type(hier_index))

<class 'pandas.core.indexes.multi.MultiIndex'>

In [14]:
import numpy as np

In [27]:
import random 
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.random.randn(6,3), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
             A         B         C
G1 1 -0.840269  0.053672 -1.139803
   2 -0.479942 -0.659747  0.075246
   3  1.086063 -0.162739  0.836227
G2 1  0.584065 -0.143204 -1.639088
   2 -0.938736 -0.451066 -0.958341
   3 -2.340282  1.766070 -0.735392

In [ ]:
#cross tabulation like pivot table

In [28]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
          A         B         C
1 -0.840269  0.053672 -1.139803
2 -0.479942 -0.659747  0.075246
3  1.086063 -0.162739  0.836227